### 예제 문제
1. csv 폴더에 있는 sales records.csv 파일 로드 
2. 'Order ID", 'Total Revenue', 'Total Cost', 'Total profit' 컬럼을 삭제
3. 컬럼의 이름을 변경 ['대륙', '국가', '타입', '채널', '우선순위', '주문일자', '발송일자', '판매단위', '단가', '원가']
4. 대륙, 국가를 기준으로 오름차순 정렬
5. 인덱스를 초기화(기존의 인덱스는 삭제)

In [ ]:
import pandas as pd

In [ ]:
## 1. 파일 로드 (상위 폴더 이동 - 하위 폴더 이동 - 파일)
sales = pd.read_csv("../csv/Sales Records.csv")
sales.head(1)

In [ ]:
## 4개의 컬럼을 삭제

## 1개의 컬럼을 삭제
sales.drop(['Order ID'], axis=1, inplace= True)

In [ ]:
## 여러개의 컬럼을 삭제
sales.drop(['Total Revenue', 'Total Cost', 'Total Profit'], 
           axis = 1, inplace=True)

In [ ]:
## 컬럼의 이름을 변경
sales.columns = ['대륙', '국가', '타입', '채널', '우선순위', 
                 '주문일자', '발송일자', '판매단위', '단가', 
                 '원가']

In [ ]:
sales.head(1)

In [ ]:
## 대륙, 국가를 기준으로 오름차순 정렬
sales.sort_values(['대륙', '국가'], inplace=True)

In [ ]:
## 인덱스를 초기화, 기존의 인덱스는 삭제

# case1
sales.reset_index(drop=True)

# case2 
sales = sales.reset_index().drop(['index'], axis=1)

In [ ]:
sales.head(3)

In [ ]:
## 총 단가, 총 원가, 총 이윤 컬럼을 생성
## 총 단가 = 단가 * 판매단위
sales['총 단가'] = sales['단가'] * sales['판매단위']
sales.head(2)

In [ ]:
## 총 원가  = 원가 * 판매단위
sales['총 원가'] = sales['원가'] * sales['판매단위']

In [ ]:
## 총 이윤 = 총 단가 - 총 원가
## 총 이윤2 = 판매단위 * (단가 - 원가)
sales['총 이윤'] = sales['총 단가'] - sales['총 원가']
sales['총 이윤2'] = sales['판매단위'] * \
    (sales['단가'] - sales['원가'])

In [ ]:
sales.head(2)

### loc[]
    - 특정 행이나 특정 열을 추출할때 사용
    - loc[행의 위치, 열의 위치]

### iloc[]
    - 특정 행이나 특정 열을 추출할때 사용
    - iloc[행의 위치 인덱스 값, 열의 위치 인덱스 값]

In [ ]:
sales.drop([2], axis=0, inplace=True)

In [ ]:
sales.loc[20:22, '국가':'단가']

In [ ]:
sales.iloc[0:2, 1:9]

### 그룹화
- groupby(그룹화 기준이 되는 컬럼)

In [ ]:
sales.groupby("국가").sum()[['총 이윤']]

In [41]:
## 가장 많은 이윤을 내는 대륙은 어디인가?
## 그룹화 - 합계 - 오름차순 or 내림차순 - 하위 값 or 상위 값

test = sales.groupby('대륙').sum()[['총 이윤']]

C:\Users\ezen\AppData\Local\Temp\ipykernel_3416\2223325140.py:4: FutureWarning: The default value of numeric_only in DataFrameGroupBy.sum is deprecated. In a future version, numeric_only will default to False. Either specify numeric_only or select only columns which should be valid for the function.
  test = sales.groupby('대륙').sum()[['총 이윤']]

In [42]:
## 내림차순 정렬 -> head(1)
test.sort_values(['총 이윤'], ascending=False).head(1)

                총 이윤
대륙
Europe  1.027000e+09

In [43]:
## 국가별 총 이윤이 높은 상위 10개의 국가를 출력
## 국가별 그룹화
test2 = sales.groupby('국가').sum()[['총 이윤']]
## 총 이윤을 기준으로 내림차순 정렬
group_df = test2.sort_values(['총 이윤'], ascending=False)
## 상위 10개 
top10 = group_df.head(10)
## 하위 10개
bottom10 = group_df.tail(10)

C:\Users\ezen\AppData\Local\Temp\ipykernel_3416\2423328530.py:3: FutureWarning: The default value of numeric_only in DataFrameGroupBy.sum is deprecated. In a future version, numeric_only will default to False. Either specify numeric_only or select only columns which should be valid for the function.
  test2 = sales.groupby('국가').sum()[['총 이윤']]

In [44]:
top10

                   총 이윤
국가
Kiribati    32454798.26
Qatar       30861356.79
Grenada     30302769.90
Taiwan      30044779.98
Malawi      29329125.05
Botswana    29019726.67
Lithuania   28063374.02
Burundi     27911293.45
Bangladesh  27854509.15
Ireland     27807805.05

In [45]:
bottom10

                              총 이윤
국가
Sao Tome and Principe  14810451.22
Singapore              14709325.91
Syria                  14536103.72
Cote d'Ivoire          14521698.84
Belize                 14384763.70
Cape Verde             14383303.52
Italy                  14199991.25
Malta                  14163744.55
Mali                   13800334.90
Tajikistan             13662027.26